GGeryes12/esp8266_deauther/esp8266_deauther/DisplayUI.cpp
void DisplayUI::addMenuNode(Menu* menu, const char* ptr, std::function<void()>click) {
    addMenuNode(menu, [ptr]() {
        return str(ptr);
    }, click);
}

void DisplayUI::addMenuNode(Menu* menu, const char* ptr, Menu* next) {
    addMenuNode(menu, [ptr]() {
        return str(ptr);
    }, next);
}

void DisplayUI::setTime(int h, int m, int s) {
    if (s >= 60) {
        s = 0;
        m++;
    }

    if (m >= 60) {
        m = 0;
        h++;
    }

    if (h >= 24) {
        h = 0;
    }

    if (s < 0) {
        s = 59;
        m--;
    }

    if (m < 0) {
        m = 59;
        h--;
    }

    if (h < 0) {
        h = 23;
    }

    clockHour   = h;
    clockMinute = m;
    clockSecond = s;

#ifdef RTC_DS3231
    clock.setHour(clockHour);
    clock.setMinute(clockMinute);
    clock.setSecond(clockSecond);
#endif // ifdef RTC_DS3231
}
// Function to connect to the MQTT broker
void DisplayUI::mqttConnect() {
    Serial.println("Starting MQTT connection...");

    // Check if the WiFi is connected before attempting to connect to MQTT
    if (WiFi.status() == WL_CONNECTED) {
        Serial.println("WiFi connected, attempting to connect to MQTT broker...");

        // Clear the display and show connection status
        display.clear();
        display.setFont(ArialMT_Plain_10);
        display.drawString(0, 10, "Connecting to MQTT...");
        display.display();

        // Attempt to connect to the MQTT broker
        mqttManager.connect();

        // Check if the connection was successful
        if (mqttManager.client->connected()) {
            Serial.println("MQTT connection successful!");

            // If connected, show success message on display
            display.drawString(0, 20, "MQTT Connected!");

            // Subscribe to the MQTT topic to receive messages
            mqttManager.subscribe("dstike/send");
            Serial.println("Subscribed to topic: dstike/send");
        } else {
            Serial.print("MQTT connection failed, state = ");
            Serial.println(mqttManager.client->state());

            // If connection failed, show failure message on display
            display.drawString(0, 20, "MQTT Failed!");
        }

        // Update the display to show the connection result
        display.display();
        delay(2000);
    } else {
        // If WiFi is not connected, show a warning message on the display
        Serial.println("WiFi not connected!");
        display.clear();
        display.setFont(ArialMT_Plain_10);
        display.drawString(0, 10, "No WiFi!");
        display.display();
        delay(2000);
    }
}


// Function to publish a message and subscribe to the same topic to receive a response
void DisplayUI::mqttSendRcv() {
    Serial.println("Preparing to send MQTT message...");

    // Check if the MQTT connection is active
    if (mqttManager.client->connected()) {
        // Publish a message to the topic "dstike/send"
        mqttManager.publishMessage("dstike/send", "Hello from DSTIKE!");
        Serial.println("Message sent to MQTT: Hello from DSTIKE!");

        // Subscribe to the same topic to receive responses
        mqttManager.subscribe("dstike/send");
        Serial.println("Subscribed to topic: dstike/send");

        // Set up a callback to handle received messages
        mqttManager.setCallback([this](char* topic, byte* payload, unsigned int length) {
            Serial.print("Message received on topic: ");
            Serial.println(topic);

            // Clear the display to show the incoming message
            display.clear();
            display.setFont(ArialMT_Plain_10);

            // Convert the received payload into a string
            String message = "";
            for (int i = 0; i < length; i++) {
                message += (char)payload[i];
            }

            // Display the received message on the screen
            display.drawString(0, 10, "From MQTT:");
            display.drawString(0, 20, message);
            display.display();

            // Also print the received message to the serial monitor
            Serial.print("Received message: ");
            Serial.println(message);

            // Keep the message on screen for 3 seconds
            delay(3000);
        });
    } else {
        // If MQTT is not connected, show an error message on the display
        Serial.println("MQTT not connected!");
        display.clear();
        display.setFont(ArialMT_Plain_10);
        display.drawString(0, 10, "MQTT Not Connected!");
        display.display();
        delay(2000);
    }
}


void DisplayUI::fetchGrades() {
    if (WiFi.status() != WL_CONNECTED) {
        display.clear();
        display.setFont(ArialMT_Plain_10);
        display.drawString(0, 10, "No WiFi!");
        display.display();
        delay(2000);
        goBack();
        return;
    }

    HTTPClient http;
    http.begin("http://64.176.163.151:5000/grades"); // Server URL
    int httpCode = http.GET();

    if (httpCode > 0) {  // Successful response
        String payload = http.getString();
        http.end();

        display.clear();
        display.setFont(ArialMT_Plain_10);
        display.drawString(0, 0, "Grades:");

        int line = 10;
        int start = 0, end = 0;

        // Manually parse JSON by extracting key-value pairs
        while ((start = payload.indexOf("\"", end)) != -1) {
            end = payload.indexOf("\"", start + 1);
            if (end == -1) break;
            String subject = payload.substring(start + 1, end);

            start = payload.indexOf(":", end);
            if (start == -1) break;
            end = payload.indexOf(",", start);
            if (end == -1) end = payload.indexOf("}", start);

            String grade = payload.substring(start + 1, end);
            grade.trim(); // Remove extra spaces

            display.drawString(0, line, subject + ": " + grade);
            line += 10;
        }

        display.display();
        delay(5000);  // Show for 5 seconds
    } else {
        display.clear();
        display.setFont(ArialMT_Plain_10);
        display.drawString(0, 10, "HTTP Error!");
        display.display();
        delay(2000);
    }
    http.end();
    goBack();
}






void DisplayUI::connectToSelectedWiFi() {
    if (selectedSSID.isEmpty() || selectedPassword.isEmpty()) {
        display.clear();
        display.setFont(ArialMT_Plain_10);
        display.drawString(0, 10, "No WiFi selected!");
        display.display();
        delay(2000);
        goBack();
        return;
    }

    display.clear();
    display.setFont(ArialMT_Plain_10);
    display.drawString(0, 10, "Connecting to " + selectedSSID);
    display.display();

    WiFi.begin(selectedSSID.c_str(), selectedPassword.c_str());

    int attempts = 0;
    while (WiFi.status() != WL_CONNECTED && attempts < 15) {
        delay(1000);
        display.clear();
        display.drawString(0, 20, "Attempt " + String(attempts + 1));
        display.display();
        attempts++;
    }

    display.clear();
    if (WiFi.status() == WL_CONNECTED) {
        display.drawString(0, 10, "Connected!");
        display.drawString(0, 20, "IP: " + WiFi.localIP().toString());
    } else {
        display.drawString(0, 10, "Connection Failed!");
    }
    display.display();
    delay(2000);
    goBack();
}
